<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/3_Windows_Functions/1_Syntax.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Windows Functions Syntax

## Overview

### ü•Ö Analysis Goals

- **Basic Window Function Syntax**: Demonstrate basic window function usage by comparing individual transaction revenue against customer and overall averages.
- **Revenue Share Analysis using SUM**: Calculate daily revenue totals and each transaction's percentage of daily revenue using window functions with SUM.
- **Customer Cohort Analysis using EXTRACT**: Group customers into cohorts based on their first purchase year to track revenue patterns over time.

### üìò Concepts Covered

- `OVER()` 
- `PARTITION BY`
- `SUM()`
- `EXTRACT()`

In [1]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## Syntax

### üìù¬†Notes

`window_function OVER (PARTITION BY)`

- **Why Use Window Functions?**
  - They let you perform calculations across a set of table rows related to the current row.
  - Unlike aggregate functions, they don't group the results into a single output row.
  - They allow you to easily partition and order data within the query, making them great for calculating things like running totals, ranks, or averages within partitions.

- **Syntax:**
    ```sql
    SELECT
        window_function() OVER (
            PARTITION BY partition_expression
        ) AS window_column_alias
    FROM table_name;
    ```

    - `OVER()`: Defines the window for the function. It can include `PARTITION BY` and other functions.
    - `PARTITION BY`: Divides the result set into partitions. The function is then applied to each partition.

### üîë Key Concepts
- **üìä Business Terms**: Window Function (row-level calculation), Partition (group of related rows), Revenue Share
- **üí° Why It Matters**: Enables detailed analysis while maintaining transaction-level granularity
- **üéØ Common Use Cases**: 
  - Market share calculations
  - Revenue distribution analysis
  - Performance comparisons within groups
- **üìà Related KPIs**: Market share %, revenue distribution

In [53]:
%%sql

SELECT 
    customerkey,
    orderkey,
    linenumber,
    (quantity * netprice * exchangerate) as net_revenue,
    AVG(quantity * netprice * exchangerate) OVER() as avg_net_revenue_all_orders,
    AVG(quantity * netprice * exchangerate) OVER(PARTITION BY customerkey) as avg_net_revenue_this_customer
FROM sales
ORDER BY customerkey
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

5 rows affected.

,customerkey,orderkey,linenumber,net_revenue,avg_net_revenue_all_orders,avg_net_revenue_this_customer
0,15,2259001,0,2217.41,1032.69,2217.41
1,180,1305016,0,525.31,1032.69,836.74
2,180,3162018,0,71.36,1032.69,836.74
3,180,3162018,1,1913.55,1032.69,836.74
4,185,1613010,0,1395.52,1032.69,1395.52

**Why I Like Window Functions**
  - Window functions are great for calculating things like running totals, ranks, or averages within partitions.

> **NOTE:** This is an example of what we'll cover this chapter; this is displayed to show the **power of window functions**.

In [54]:
%%sql

SELECT 
    customerkey as customer,
    orderdate,  -- Added to make running totals more meaningful
    (quantity * netprice * exchangerate) as net_revenue,
    ROW_NUMBER() OVER(
        PARTITION BY customerkey 
        ORDER BY quantity * netprice * exchangerate DESC
    ) as order_rank,
    SUM(quantity * netprice * exchangerate) OVER(
        PARTITION BY customerkey 
        ORDER BY orderdate
    ) as customer_running_total,
    SUM(quantity * netprice * exchangerate) OVER(PARTITION BY customerkey) as customer_net_revenue,
    (quantity * netprice * exchangerate) / SUM(quantity * netprice * exchangerate) OVER(PARTITION BY customerkey) * 100 as pct_customer_revenue
FROM sales
ORDER BY customerkey, orderdate
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

,customer,orderdate,net_revenue,order_rank,customer_running_total,customer_net_revenue,pct_customer_revenue
0,15,2021-03-08,2217.41,1,2217.41,2217.41,100.00
1,180,2018-07-28,525.31,2,525.31,2510.22,20.93
2,180,2023-08-28,1913.55,1,2510.22,2510.22,76.23
3,180,2023-08-28,71.36,3,2510.22,2510.22,2.84
4,185,2019-06-01,1395.52,1,1395.52,1395.52,100.00
5,243,2016-05-19,287.67,1,287.67,287.67,100.00
6,387,2018-12-21,619.77,3,2370.54,4655.84,13.31
7,387,2018-12-21,1608.10,1,2370.54,4655.84,34.54
8,387,2018-12-21,97.05,7,2370.54,4655.84,2.08
9,387,2018-12-21,45.62,8,2370.54,4655.84,0.98

---
## SUM

### üìù¬†Notes

`SUM`

- **SUM**: Sums up all of the values
- Syntax: 
  ```sql
    SELECT
      SUM() OVER(
          PARTITION BY partition_expression
      ) AS window_column_alias
      FROM table_name
  ```

### üìà Analysis

- Calculate the daily net revenue and the percent of the order line number over the daily net revenue.

#### Calculate Total Net Revenue by Day

**`SUM`**, **`OVER`**, **`PARTITION BY`**

1. Get the `orderdate`, `orderkey`, `linenumber` and calculate net revenue (for each order) from the `sales` table.
    - Select the `orderdate`,`orderkey`, and `linenumber`
    - Calculate `net_revenue` by multiplying `quantity`, `netprice`, and `exchangerate` to obtain the revenue for each individual sale.
    - Order the results by `orderdate` to present the data chronologically.

In [2]:
%%sql

SELECT
    orderdate,
    orderkey,
    linenumber,
    (quantity * netprice * exchangerate) AS net_revenue
FROM 
    sales
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

    orderdate  orderkey  linenumber  net_revenue
0  2015-01-01      1000           0        63.49
1  2015-01-01      1000           1       423.28
2  2015-01-01      1001           0       108.75
3  2015-01-01      1002           0      1146.75
4  2015-01-01      1002           1       950.25
5  2015-01-01      1002           2      1302.91
6  2015-01-01      1002           3        58.73
7  2015-01-01      1003           0       224.98
8  2015-01-01      1004           0       263.11
9  2015-01-01      1004           1       578.52

2. Get the `orderdate` and calculate net revenue (for each order), total net revenue (by each day), and percent of daily revenue from the `sales` table.
    - Select the `orderdate` and the order line item by `orderkey * 10 + linenumber`.
    - Calculate `net_revenue` by multiplying `quantity`, `netprice`, and `exchangerate` to obtain the revenue for each individual sale.
    - üîî Use a `SUM` window function with `OVER(PARTITION BY orderdate)` to compute `daily_net_revenue` for all orders sharing the same `orderdate`.
    - üîî Order the results by `orderdate` and `pct_daily_revenue` (in descending order).
    - üîî Calculate the percentage of total revenue share for each order by dividing the `net_revenue` by the `daily_net_revenue` and multiplying by 100.

In [56]:
%%sql

SELECT
    orderdate,
    orderkey * 10 + linenumber AS order_line_item,
    (quantity * netprice * exchangerate) AS net_revenue,
    SUM(quantity * netprice * exchangerate) OVER(PARTITION BY orderdate) AS daily_net_revenue, -- Added
    100 * (quantity * netprice * exchangerate) / SUM(quantity * netprice * exchangerate) OVER(PARTITION BY orderdate) AS pct_daily_revenue
FROM 
    sales
ORDER BY
    orderdate,
    pct_daily_revenue DESC
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

,orderdate,order_line_item,net_revenue,daily_net_revenue,pct_daily_revenue
0,2015-01-01,10043,2395.10,11640.80,20.58
1,2015-01-01,10061,1552.32,11640.80,13.34
2,2015-01-01,10022,1302.91,11640.80,11.19
3,2015-01-01,10020,1146.75,11640.80,9.85
4,2015-01-01,10050,975.16,11640.80,8.38
5,2015-01-01,10021,950.25,11640.80,8.16
6,2015-01-01,10041,578.52,11640.80,4.97
7,2015-01-01,10081,574.05,11640.80,4.93
8,2015-01-01,10001,423.28,11640.80,3.64
9,2015-01-01,10040,263.11,11640.80,2.26

<img src="../Resources/images/3.1_daily_revenue.png" alt="Daily Revenue Share" width="50%">

### üí° Why not use GROUP BY instead? 

- Window functions are good when you need both row-level information and aggregated values.
- **Limitation of `GROUP BY`:** Grouping by `orderdate` can tell you the net revenue per order date, but it aggregates at the order date level, so you lose individual order details. 
- Adding windows functions let us make calculations like the percentage of revenue share for each order (what we'll be doing next).

---
## Subqueries Review

**SubQueries**

- **Subquery**: a query nested inside another query. 
    - Subqueries let you perform complex queries by using the result of one query as input for another. 
    - It can be used in clauses like `SELECT`, `FROM`, `WHERE`, and `HAVING`.

**Syntax**:
- In `SELECT` clause
    - ```sql
      SELECT 
        column1, 
        column2, 
        (SELECT single_value_expression FROM table_name WHERE condition) AS alias_name
      FROM main_table
      WHERE condition;
      ```
- In `WHERE` clause 
    - ```sql
      SELECT column1, column2
      FROM table_name
      WHERE column_name operator (SELECT column_name FROM table_name WHERE condition);
      ```
- In `FROM` clause
    - ```sql
      SELECT alias_name.column1, alias_name.column2
      FROM (
        SELECT column1, column2 
        FROM table_name 
        WHERE condition
      ) AS alias_name
      WHERE condition
      ```
- There are more ways to use subqueries, such as with `EXISTS`, `NOT EXISTS`, correlated subqueries, and in `HAVING`, but these are the most common.

### üìà Analysis

- Calculate for each transaction the percentage of total revenue share.

#### Percentage of Total Revenue Share

**Subquery**

1. Calculate for each transaction the percentage of total revenue share.
    - üîî Select `orderdate`, `net_revenue`, and `total_net_revenue` from the subquery.  
    - üîî Calculate `revenue_share` by dividing `net_revenue` by `total_net_revenue` for each row.  
    - Use a subquery that calculates `net_revenue` as the product of `quantity`, `netprice`, and `exchangerate`.  
        - Use a window function (`SUM` with `PARTITION BY orderdate`) in the subquery to compute `total_net_revenue` for each `orderdate`.  
    - Order the final results by `orderdate`.

In [59]:
%%sql

SELECT
    *,
    100 * net_revenue / daily_net_revenue AS pct_daily_revenue
FROM 
    -- Use query from previous section (Calculate Daily Net Revenue) as a subquery
    (
    SELECT
        orderdate,
        orderkey * 10 + linenumber AS order_line_item,
        (quantity * netprice * exchangerate) AS net_revenue,
        SUM(quantity * netprice * exchangerate) OVER(PARTITION BY orderdate) AS daily_net_revenue
    FROM
        sales
    ) AS revenue_by_day
ORDER BY
    orderdate,
    pct_daily_revenue DESC
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

,orderdate,order_line_item,net_revenue,daily_net_revenue,pct_daily_revenue
0,2015-01-01,10043,2395.10,11640.80,20.58
1,2015-01-01,10061,1552.32,11640.80,13.34
2,2015-01-01,10022,1302.91,11640.80,11.19
3,2015-01-01,10020,1146.75,11640.80,9.85
4,2015-01-01,10050,975.16,11640.80,8.38
5,2015-01-01,10021,950.25,11640.80,8.16
6,2015-01-01,10041,578.52,11640.80,4.97
7,2015-01-01,10081,574.05,11640.80,4.93
8,2015-01-01,10001,423.28,11640.80,3.64
9,2015-01-01,10040,263.11,11640.80,2.26

<img src="../Resources/images/3.1_daily_revenue.png" alt="Daily Revenue Share" width="50%">

---
## MIN()

### üìù Notes

`MIN() OVER (PARTITION BY)`

- **MIN OVER**: Extracts minimum value for each row within a partition
- Syntax: 
  ```sql
    SELECT
      MIN(field) OVER(
          PARTITION BY partition_expression
      ) AS window_column_alias
      FROM table_name
  ```

### üîë Key Concepts
- **üìä Business Terms**: Cohort Analysis, Time-based Segmentation, Revenue Tracking
- **üí° Why It Matters**: Groups customers by time periods to analyze behavior patterns
- **üéØ Common Use Cases**: 
  - Customer cohort analysis
  - Year-over-year comparisons
  - Time-based customer segmentation
- **üìà Related KPIs**: Cohort revenue, Year-based growth

#### üìï Definitions

- **Cohort**: A group of people or items sharing a common characteristic. 
- **Cohort analysis**: Examines the behavior of specific groups over time.  

### üìà Analysis

- Group customers into cohorts based on their first purchase year and track their revenue over time.

#### Calculate Revenue by Cohort Year

**`EXTRACT`**, **`MIN`**, **`OVER`**, **`PARTITION BY`**

1. Get the cohort year for each customer using window functions.
    - Use `MIN(orderdate) OVER (PARTITION BY customerkey)` to get the first order date for each customer
    - Then use `EXTRACT(YEAR FROM ...)` on this result to get the cohort year
    - Example: `EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey)) AS cohort_year`
    - Join back to sales to calculate revenue for each cohort by year
    - Group and order results by cohort year and purchase year

In [60]:
%%sql

SELECT DISTINCT
    customerkey,
    EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey)) AS cohort_year
FROM sales
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

   customerkey cohort_year
0           15        2021
1          180        2018
2          185        2019
3          243        2016
4          387        2018
5          406        2021
6          545        2023
7          649        2022
8          668        2019
9          688        2023

2. Join the cohort data back to the original sales table.
    - üîî Define a CTE using the main query above to calculate the yearly cohort.
    - üîî Use `LEFT JOIN` to combine `sales` with `yearly_cohort` CTE
    - üîî Join on `customerkey` to match each sale with its customer's cohort year
    - Select all columns to verify the join worked correctly

In [61]:
%%sql

WITH yearly_cohort AS (
    SELECT DISTINCT
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey)) AS cohort_year
    FROM sales
)
SELECT *
FROM sales s
JOIN yearly_cohort y ON s.customerkey = y.customerkey
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

,orderkey,linenumber,orderdate,deliverydate,customerkey,storekey,productkey,quantity,unitprice,netprice,unitcost,currencycode,exchangerate,customerkey,cohort_year
0,1000,0,2015-01-01,2015-01-01,947009,400,48,1,112.46,98.97,57.34,GBP,0.64,947009,2015
1,1000,1,2015-01-01,2015-01-01,947009,400,460,1,749.75,659.78,382.25,GBP,0.64,947009,2015
2,1001,0,2015-01-01,2015-01-01,1772036,430,1730,2,54.38,54.38,25.00,USD,1.00,1772036,2015
3,1002,0,2015-01-01,2015-01-01,1518349,660,955,4,315.04,286.69,144.88,USD,1.00,1518349,2015
4,1002,1,2015-01-01,2015-01-01,1518349,660,62,7,135.75,135.75,62.43,USD,1.00,1518349,2015
5,1002,2,2015-01-01,2015-01-01,1518349,660,1050,3,499.20,434.30,229.57,USD,1.00,1518349,2015
6,1002,3,2015-01-01,2015-01-01,1518349,660,1608,1,65.99,58.73,33.65,USD,1.00,1518349,2015
7,1003,0,2015-01-01,2015-01-01,1317097,510,85,3,74.99,74.99,34.48,USD,1.00,1317097,2015
8,1004,0,2015-01-01,2015-01-01,254117,80,128,2,114.72,113.57,58.49,CAD,1.16,254117,2015
9,1004,1,2015-01-01,2015-01-01,254117,80,2079,1,499.45,499.45,165.48,CAD,1.16,254117,2015

3. Calculate final cohort revenue metrics.
    - Select `cohort_year` from the yearly_cohort CTE
    - Get purchase year using `EXTRACT(YEAR FROM orderdate)`
    - üîî Calculate total revenue as `SUM(quantity * netprice * exchangerate)`
    - üîî Group by both `cohort_year` and `purchase_year`
    - üîî Order by `cohort_year` and `purchase_year` to show progression

In [70]:
%%sql

WITH yearly_cohort AS (
    SELECT DISTINCT
        customerkey,
        EXTRACT(YEAR FROM MIN(orderdate) OVER (PARTITION BY customerkey)) AS cohort_year
    FROM sales
)
SELECT 
    y.cohort_year,
    EXTRACT(YEAR FROM s.orderdate) AS purchase_year,
    SUM(s.quantity * s.netprice * s.exchangerate) AS net_revenue
FROM sales s
LEFT JOIN yearly_cohort y ON s.customerkey = y.customerkey
GROUP BY 
    y.cohort_year,
    purchase_year
ORDER BY 
    y.cohort_year, 
    purchase_year
LIMIT 40

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

40 rows affected.

   cohort_year purchase_year  net_revenue
0         2015          2015   7370979.48
1         2015          2016    392623.48
2         2015          2017    479841.31
3         2015          2018   1069850.87
4         2015          2019   1235991.48
5         2015          2020    386489.60
6         2015          2021    872845.99
7         2015          2022   1569787.72
8         2015          2023   1157633.91
9         2015          2024    356186.62
10        2016          2016   9990990.20
11        2016          2017    497028.11
12        2016          2018   1074607.29
13        2016          2019   1565400.72
14        2016          2020    474087.09
15        2016          2021    964417.85
16        2016          2022   2164681.10
17        2016          2023   1265242.63
18        2016          2024    364066.76
19        2017          2017  12244469.63
20        2017          2018   1407065.13
21        2017          2019   1764716.90
22        2017          2020    625928.03
23        2017          2021   1329858.72
24        2017          2022   2428882.80
25        2017          2023   1714010.18
26        2017          2024    464802.56
27        2018          2018  21115924.55
28        2018          2019   3229188.22
29        2018          2020   1171126.65
30        2018          2021   2201262.39
31        2018          2022   4534295.81
32        2018          2023   3271753.92
33        2018          2024    936833.89
34        2019          2019  24022798.65
35        2019          2020   1295044.99
36        2019          2021   2337594.77
37        2019          2022   4848980.74
38        2019          2023   3440099.20
39        2019          2024    751725.53

<img src="../Resources/images/3.1_cohort_year_rev.png" alt="Processing & Revenue" width="50%">